# Functions & DataFrame - Exercise
Â© Advanced Analytics, Amir Ben Haim, 2024

## Filter `df` using `def` function

### Exercise 1

First, import the `pandas` library to the environment

In [13]:
import pandas as pd

<br>
<hr class="dotted">
<br>

### Exercise 2

Create the following df:

```python
df = pd.DataFrame({
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi','barbara','chen','debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    })
df
```

In [70]:
df = pd.DataFrame({
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi','barbara','chen','debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    })
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

<br>
<hr class="dotted">
<br>

### Exercise 3

Create a functions `filtered_df` as follows:
<br>
The functionn recieves a df, a column name and a value --> then filters the df accordinly

Also, use the function with column 'age', and value 25
```python

# Create the function


# Use the function
filtered_df(df,'age',25)


```

In [61]:
def filtered_df(df,k,v):
    df = df[df[k]==v]
    return df
    
filtered_df(df,'age',25)

   id   name   age  student
0   1    Avi  25.0     True
3   4  Doron  25.0     True

<br>
<hr class="dotted">
<br>

### Exercise 4

Use the function with column 'age', and value 25, 40.
<br><b><u>If needed, adjust the fuction accordinly</u></b>
```python

# Use the function
filtered_df(df,'age',25,40)


```

In [65]:
def filtered_df(df,k,*v):
    
    df = df[df[k].isin(v) ]
    return df
    
filtered_df(df,'age',25,40)

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
3   4  Doron  25.0     True
5   6    abi  40.0     True

<br>
<hr class="dotted">
<br>

### Exercise 5

Create a function `dict_filters_df` that recieves a dictionary and filters the df accordinly

```python
#define the dic


# Create the function


# Use the function
dict_filters_df(df, d)


```

In [106]:
def dict_filters_df(df, d):
    for k, v in d.items():
        j = df[k].isin(v)
    return df[j]
    
    
d = {'age':[25,40], 'student':[True]}
dict_filters_df(df, d)

   id   name   age  student
0   1    Avi  25.0     True
3   4  Doron  25.0     True
5   6    abi  40.0     True
7   8   chen  46.5     True

<br>
<hr class="dotted">
<br>

### Exercise 6

Use the function with the following `dict`
<br><b><u>If needed, adjust the fuction accordinly</u></b>

```python
#define the dic
d = {'age':[25,40], 'student':[False]}


# Use the function
dict_filters_df(df, d)


```

In [97]:
#define the dic
d = {'age':[25,40], 'student':[False]}


# Use the function
dict_filters_df(df, d)

   id   name   age  student
1   2  Betti  40.0    False

<br>
<hr class="dotted">
<br>

### Exercise 7

Use the function with the following `dict`
<br><b><u>If needed, adjust the fuction accordinly</u></b>

```python
#define the dic
d = {'age':[25,40], 'student':[True,False]}


# Use the function
dict_filters_df(df, d)


```

In [98]:
#define the dic
d = {'age':[25,40], 'student':[True,False]}


# Use the function
dict_filters_df(df, d)

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
3   4  Doron  25.0     True
5   6    abi  40.0     True

<br>
<hr class="dotted">
<br>

### Exercise 8

Use the function with the following `dict`
<br><b><u>If needed, adjust the fuction accordinly</u></b>

```python
#define the dic
d = {'age':[25,40], 'student':[True,False], 'name': ['Avi','abi']}


# Use the function
dict_filters_df(df, d)


```

In [99]:
#define the dic
d = {'age':[25,40], 'student':[True,False], 'name': ['Avi','abi']}


# Use the function
dict_filters_df(df, d)

   id name   age  student
0   1  Avi  25.0     True
5   6  abi  40.0     True